import React from "react";
import ScrollAnimation from "react-animate-on-scroll";
import { Col, Row } from "react-bootstrap";

export default function Role() {
  return (
    <div>
      <ScrollAnimation animateIn="fadeIn">
        <h2 className="text-center mt-5 mb-4 main-color">
          دور الشركة لعملائها
        </h2>
      </ScrollAnimation>
      <ScrollAnimation animateIn="fadeIn">
        <Row className="justify-content-evenly">
          <Col
            md={5}
            className="border shadow-sm p-4 text-center align-items-center d-flex justify-content-center mb-4"
          >
            تسعى الشركة إلى تحقيق التواصل الدائم والمستمر مع عملائها الكرام بهدف
            إتاحة المعلومات الضرورية عن الشركة والتعريف بأنشطتها المختلفة وتوفير
            الحماية التأمينية للعملاء والمشروعات ضد المخاطر المتنوعة. يشمل ذلك
            تأمينات الأشخاص الفردية والجماعية، التأمين الصحي، الحوادث الشخصية،
            وتأمينات الممتلكات والمسؤوليات التي تشمل تأمين السيارات، الحريق،
            البترول، التأمين الهندسي، العنف السياسي، أخطار النقل البري، النهري،
            البحري، والجوي، بالإضافة إلى التأمينات الزراعية والقروض. كما تحرص
            الشركة على التواصل مع العملاء لتلقي استفساراتهم ومقترحاتهم، والعمل
            على توضيح وحل المشكلات التأمينية، وتوفير كل ما هو جديد في سوق
            التأمين المصري، سواء كانت منتجات تأمينية جديدة، تغطيات تأمينية،
            تشريعات، أو أي أمور تهم عملائنا الكرام.
          </Col>
          <Col
            md={5}
            className="border shadow-sm p-4 text-center align-items-center d-flex justify-content-center mb-4"
          >
            تعمل الشركة على تلبية احتياجات عملائها من خلال تحديد احتياجاتهم
            بأسلوب متميز وبأسعار مناسبة. تقوم بدور هام لعملائها من خلال متابعة
            إصدار وثائق التأمين، حيث تبدأ بدراسة احتياجات العميل التأمينية، ثم
            تتواصل مع شركات التأمين نيابةً عن العميل لتقديم العروض، وتفعيل
            المنافسة بينها سواء فيما يتعلق بالتغطيات، الشروط، أو الأسعار
            المطبقة. بعد ذلك، تُرشح أفضل العروض والتغطيات والشروط بأفضل الأسعار،
            ثم تتولى متابعة عمليات الإصدار ومراجعة الوثائق وأخيراً متابعة
            التعويضات، مع الالتزام الكامل بأخلاقيات المهنة واحترام سرية معلومات
            عملائها.
          </Col>
        </Row>
      </ScrollAnimation>
    </div>
  );
}
