import React from "react";
import ScrollAnimation from "react-animate-on-scroll";
import { Col, Row } from "react-bootstrap";

export default function Role() {
  return (
    <div>
      <ScrollAnimation animateIn="fadeIn">
        <h2 className="text-center mt-5 mb-4 main-color">
          دور الشركة لعملائها
        </h2>
      </ScrollAnimation>
      <ScrollAnimation animateIn="fadeIn">
        <Row className="justify-content-evenly">
          <Col
            md={5}
            className="border shadow-sm p-4 text-center align-items-center d-flex justify-content-center mb-4"
          >
            تسعى الشركة البافارية للوساطة التأمينية إلى تحقيق التواصل الدائم
            والمستمر مع عملائها الكرام بهدف إتاحة المعلومات الضرورية عن الشركة
            والتعريف بانشطتها المختلفة وتوفير الحماية التأمينية للعملاء
            والمشروعات ضد المخاطر المختلفة وذلك من خلال تأمينات الاشخاص الفردى
            والجماعى .والعلاج الطبى والحوادث الشخصية – وتأمينات الممتلكات
            والمسئوليات التى تشمل تأمينات السيارات ، الحريق ، البترول ، الهندسى
            ، العنف السياسى ، اخطار النقل البرى والنهرى والبحرى والجوى ،
            التأمينات الزراعية والقروض ، كذلك التواصل مع العملاء وتلقى
            استفساراتهم ومقترحاتهم والعمل على توضيح وحل المشكلات التأمينية ،
            كذلك توصيل كل ماهو جديد فى سوق التأمين المصرى سواء كانت منتجات
            تأمينية جديدة ، أو تغطيات تأمينية ، أو تشريعات أو أى شىء يهم عملائنا
            الكرام .
          </Col>
          <Col
            md={5}
            className="border shadow-sm p-4 text-center align-items-center d-flex justify-content-center mb-4"
          >
            كما تعمل الشركة البافارية للوساطة التأمينية على تلبية احتياجات
            عملائها .. وذلك من خلال تحديد احتياجات العميل بأسلوب متميز ، وسعر
            مناسب ، حيث تقوم بدور مهم لعملائها من خلال متابعة إصدار وثائق
            التأمين لعملائها ، حيث تقوم اولا بدراسة احتياجات عميلها التأمينية ،
            ثم تبدأ بمخاطبة شركات التأمين ليدعوها نيابة عن عميلة لتقديم عروض ،
            ويقوم بتفعيل المنافسة فيما بينها ، سواء فيما يخص التغطيات أو الشروط
            أو فيما يخص السعر المطبق ويقوم بترشيح افضل العروض والتغطيات والشروط
            و افضل الاسعار ثم يتولى متابعة عمليات الاصدار ومراجعة الوثائق واخيرا
            متابعة التعويضات ، مع الالتزام الكامل بأخلاقيات المهنة ، وأحترام
            سرية المعلومات لعملائها .
          </Col>
        </Row>
      </ScrollAnimation>
    </div>
  );
}
