import React from "react";
import { Button, Col, Container, Row } from "react-bootstrap";

export default function About() {
  return (
    <section id="about-section" className="text-light p-3 my-5">
      <Container className="py-5 px-4 rounded-4">
        <Row>
          <Col md={6}>
            <h1 className="fw-bold secondary-color mb-4">احنا مين ؟</h1>
            <p>
              الشـــركة البـــــــافاريةللوســــاطة التـــــأمينية ( Bavarian
              Insurance Brokerage BIB ) ( ش.م.م ) خاضعة لأحكام القانون رقم (
              159) لسنة 1981 ، ومسجلة بسجل هيئة الاستثمار رقم 119992 بتاريخ
              18/04/2018 والقانون رقم (10) لسنة 1981 بإصدار قانون الأشراف
              والرقابة على التأمين فى مصر ولائحتة التنفيذية وتعديلاتهما ،
              والقانون رقم (10) لسنة 2009 بتنظيم الرقابة على الأسواق المالية غير
              المصرفية ، ومسجلة فى الهيئة بالقرار رقم ( 795 ) لسنة 2018 بتاريخ
              28/06/2018 وقيدها بسجل وسطاء التأمين وإعادة التأمين بالهيئة ( شخص
              اعتبارى ) تحـــــت رقـــــم ( 80 )بتاريخ 28/06/2018 ، برأس مال
              مصرى 100%.
            </p>
          </Col>
          <Col md={6}>
            <h1 className="fw-bold secondary-color mb-4">ايه هو دورنا؟</h1>
            <p>
              تسعى الشركة البافارية للوساطة التأمينية إلى تحقيق التواصل الدائم
              والمستمر مع عملائها الكرام بهدف إتاحة المعلومات الضرورية عن الشركة
              والتعريف بانشطتها المختلفة وتوفير الحماية التأمينية للعملاء
              والمشروعات ضد المخاطر المختلفة وذلك من خلال تأمينات الاشخاص الفردى
              والجماعى والعلاج الطبى والحوادث الشخصية – وتأمينات الممتلكات
              والمسئوليات التى تشمل تأمينات السيارات ، الحريق ، البترول ،
              الهندسى ، العنف السياسى ، اخطار النقل البرى والنهرى والبحرى والجوى
              ، التأمينات الزراعية والقروض.
            </p>
          </Col>
        </Row>

        <Button variant="warning" className="secondary-background text-light">
          اعرف عننا اكتر
        </Button>
      </Container>
    </section>
  );
}
